tutorial/mooringCase-H15T18/mooredFloatingObject/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.9;
}

gradSchemes
{
    default         Gauss linear;
    //default         cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
    //limitedGrad     cellLimited Gauss linear 1;
}

divSchemes
{
    div(rhoPhi,U)   Gauss vanLeerV;
    //div(rhoPhi,U)   Gauss linearUpwind grad(U);
    
    div(phi,alpha)   Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    
    div(phi,k)       Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    //div(phi,k)      Gauss linearUpwind limitedGrad;
    //div(phi,omega)  Gauss linearUpwind limitedGrad;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected; //
    //default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected; // 
    //default         limited corrected 0.5;
}

/*
wallDist
{
    method meshWave;
}

*/

// ************************************************************************* //
