tutorial/mooringCase-H15T18/mooredFloatingObject/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // floating object
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            //box (1.85 0 0.3) (2.15 0.42 0.5); // intial CoG z=0.40
			box (-0.1 -0.1 -0.0786) (0.1 0.1 0.0534);
        }
    }

    {
        name    c0;
        type    cellSet;
        action  invert;
    }
    
);

// ************************************************************************* //
